[
  "SoftwareProduct",
  "Group",
  "Attacker",
  "firstSteps",
  "RoutingFirewall",
  "Credentials",
  "Application",
  "ConnectionRule",
  "PhysicalZone",
  "Identity",
  "Hardware",
  "Information",
  "Vulnerability",
  "Privileges",
  "IAMObject",
  "Data",
  "HardwareVulnerability",
  "[none]",
  "IDPS",
  "Network",
  "SoftwareVulnerability",
  "User",
  "read",
  "attemptAccessUninspectedFromPhysicalAccess",
  "successfulDeny",
  "adversaryInTheMiddleDefenseBypassed",
  "attemptWriteFromReplica",
  "accessDecryptedData",
  "attemptAccessInspectedFromPhysicalAccess",
  "fullAccessFromSupplyChainCompromise",
  "bypassEavesdropDefenseFromPhysicalAccess",
  "guessCredentials",
  "successfulModify",
  "successfulAdversaryInTheMiddle",
  "successfulAccessNetworksUninspected",
  "localConnect",
  "attemptUseVulnerabilityFromSoftwareFullAccess",
  "softwareProductVulnerabilityLowPrivilegesAchieved",
  "attemptCredentialTheft",
  "connectToApplicationsUninspected",
  "accessUnsignedData",
  "spreadWormThroughRemovableMedia",
  "readApplications",
  "credentialsReuse",
  "connectToApplicationsInspected",
  "impact",
  "specificAccess",
  "successfulAccessUninspectedFromPhysicalAccess",
  "hardwareModifications",
  "applicationRespondConnect",
  "eavesdrop",
  "userInteractionAchieved",
  "specificAccessFromLocalConnection",
  "softwareProductVulnerabilityHighPrivilegesAchieved",
  "accessNetworkData",
  "attackerUnsafeUserActivityCapabilityWithReverseReach",
  "successfulHardwareModifications",
  "authorizedWriteFromIAM",
  "denyApplications",
  "denyFromSoftProdVulnerability",
  "effectivenessBypassed",
  "accessUnencryptedData",
  "attemptUse",
  "bypassEffectiveness",
  "attemptExploit",
  "attemptAuthorizedApplicationRespondConnectThroughData",
  "authorizedApplicationRespondConnect",
  "successfulAccessInspectedFromPhysicalAccess",
  "attemptUseVulnerability",
  "attemptReverseReach",
  "attemptReadFromSoftProdVulnerability",
  "guessCredentialsFromHash",
  "attemptExtractFromReplica",
  "socialEngineering",
  "networkAccess",
  "highPrivilegesAchieved",
  "deliverMaliciousRemovableMedia",
  "attemptAccessNetworksUninspected",
  "lockout",
  "propagateOneCredentialCompromised",
  "attemptAdversaryInTheMiddle",
  "attemptCredentialsReuse",
  "denyFromLockout",
  "bypassPayloadInspectionFromEncryptedData",
  "attemptModify",
  "networkConnectFromResponse",
  "compromiseApplications",
  "authorizedDelete",
  "accessInspected",
  "fullAccess",
  "localAccessAchieved",
  "deny",
  "attemptDelete",
  "reverseReach",
  "networkConnectInspected",
  "networkForwardingUninspected",
  "softwareProductVulnerabilityNetworkAccessAchieved",
  "attemptDeliverMaliciousRemovableMedia",
  "lockoutFromMembers",
  "authorizedDeleteFromIAM",
  "softwareProductVulnerabilityUserInteractionAchieved",
  "abuse",
  "bypassPayloadInspection",
  "successfulUnsafeUserActivity",
  "authorizedReadFromApplication",
  "authorizedAccessFromApplication",
  "attemptApplicationRespondConnectThroughData",
  "successfulDelete",
  "successfulLockout",
  "successfulSupplyChainAttack",
  "attemptUnsafeUserActivity",
  "dataSigned",
  "specificAccessAuthenticate",
  "missingUser",
  "modifyFromSoftProdVulnerability",
  "specificAccessNetworkConnect",
  "networkForwardingInspected",
  "missingIdentity",
  "attemptSpreadWormThroughRemovableMedia",
  "attackerUnsafeUserActivityCapability",
  "passwordReuseCompromise",
  "attackerUnsafeUserActivityCapabilityWithoutReverseReach",
  "attemptWrite",
  "oneCredentialCompromised",
  "bypassAdversaryInTheMiddleDefense",
  "bypassSecurityAwareness",
  "attemptModifyFromSoftProdVulnerability",
  "attemptNetworkConnectFromResponse",
  "attemptHardwareModifications",
  "applicationRespondConnectThroughData",
  "attemptDeleteFromReplica",
  "securityAwarenessBypassed",
  "softwareProductAbuse",
  "attemptConnectToApplicationsUninspected",
  "useVulnerability",
  "successfulSpreadWormThroughRemovableMedia",
  "accessSpoofedData",
  "adversaryInTheMiddle",
  "attemptSupplyChainAttack",
  "extract",
  "lockoutFromCredentials",
  "use",
  "specificAccessRead",
  "accessControlBypassed",
  "assume",
  "accessNetworksInspected",
  "denyFromNetworkingAsset",
  "attemptReadFromReplica",
  "exploitWithEffort",
  "successfulUseVulnerabilityFromPhysicalAccess",
  "attemptDeny",
  "accessNetworksUninspected",
  "readFromSoftProdVulnerability",
  "successfulRead",
  "networkConnectUninspected",
  "bypassEavesdropDefense",
  "localAccess",
  "attemptEavesdrop",
  "hardwareModificationsProtectionBypassed",
  "exploit",
  "[nop]",
  "specificAccessDelete",
  "physicalAccess",
  "authorizedRead",
  "successfulWrite",
  "successfulApplicationRespondConnectThroughData",
  "attemptUseVulnerabilityFromPhysicalAccess",
  "successfulDeliverMaliciousRemovableMedia",
  "payloadInspectionBypassed",
  "authorizedReadFromIAM",
  "authorizedDeleteFromApplication",
  "gainPhysicalAccess",
  "authorizedApplicationRespondConnectFromApplication",
  "attemptApplicationRespondConnect",
  "payloadInspectionBypassFromEncryptedData",
  "supplyChainAttack",
  "bypassSupplyChainAuditing",
  "modifyApplications",
  "lowPrivilegesAchieved",
  "unsafeUserActivity",
  "successfulAccessNetworksInspected",
  "attemptLockout",
  "softwareProductVulnerabilityPhysicalAccessAchieved",
  "bypassRestricted",
  "restrictedBypassed",
  "eavesdropDefenseBypassed",
  "attemptAbuse",
  "[end]",
  "attemptFullAccessFromSupplyChainCompromise",
  "successfulSocialEngineering",
  "exploitTrivially",
  "delete",
  "softwareProductVulnerabilityLocalAccessAchieved",
  "attemptAssume",
  "modify",
  "accessNetworkAndConnections",
  "successfulEavesdrop",
  "softwareCheck",
  "inherentUserInteraction",
  "bypassAccessControl",
  "weakCredentials",
  "attemptAccessNetworksInspected",
  "write",
  "accessUninspected",
  "attemptDenyFromReplica",
  "attemptSoftwareProductAbuse",
  "successfulUseVulnerability",
  "specificAccessModify",
  "attemptDenyFromSoftProdVulnerability",
  "authorizedApplicationRespondConnectThroughData",
  "bypassHardwareModificationsProtection",
  "authorizedApplicationRespondConnectFromIAM",
  "attemptConnectToApplicationsInspected",
  "successfulReverseReach",
  "successfulAssume",
  "bypassAdversaryInTheMiddleDefenseFromPhysicalAccess",
  "credsHashed",
  "physicalAccessAchieved",
  "authenticate",
  "bypassContainerization",
  "authorizedWrite",
  "dataEncrypted",
  "supplyChainAuditingBypassed",
  "credentialTheft",
  "attemptSocialEngineering",
  "successfulAuthorizedApplicationRespondConnectThroughData",
  "authorizedWriteFromApplication",
  "specificAccessFromNetworkConnection",
  "attemptRead",
  "useLeakedCredentials",
  "attemptPropagateOneCredentialCompromised",
  "networkAccessAchieved",
  "networkConnect",
  "adversaryInTheMiddleDefense",
  "eavesdropDefense",
  "integrityImpactLimitations",
  "availabilityImpactLimitations",
  "unique",
  "hardwareModificationsProtection",
  "userInteractionRequired",
  "confidentialityImpactLimitations",
  "noPasswordReuse",
  "[nop]",
  "highComplexityExploitRequired",
  "effectiveness",
  "restricted",
  "networkAccessRequired",
  "lowPrivilegesRequired",
  "localAccessRequired",
  "notGuessable",
  "payloadInspection",
  "notPresent",
  "highPrivilegesRequired",
  "networkAccessControl",
  "supplyChainAuditing",
  "securityAwareness",
  "notPhishable",
  "[end]",
  "noRemovableMediaUsage",
  "effortRequiredToExploit",
  "physicalAccessRequired",
  "notDisclosed"
]