{
  "objects": [
    "RoutingFirewall",
    "Data",
    "Vulnerability",
    "[none]",
    "Group",
    "Hardware",
    "PhysicalZone",
    "HardwareVulnerability",
    "Credentials",
    "Identity",
    "SoftwareVulnerability",
    "IAMObject",
    "ConnectionRule",
    "Privileges",
    "Application",
    "SoftwareProduct",
    "Network",
    "Information",
    "User",
    "IDPS"
  ],
  "attacker_actions": [
    "DeleteFromReplica",
    "authorizedDeleteFromApplication",
    "supplyChainAttack",
    "extract",
    "deny",
    "localAccess",
    "lockout",
    "bypassEavesdropDefense",
    "authorizedRead",
    "impact",
    "accessUninspected",
    "bypassEffectiveness",
    "WriteFromReplica",
    "authorizedApplicationRespondConnectFromApplication",
    "accessNetworksUninspected",
    "SocialEngineering",
    "PropagateOneCredentialCompromised",
    "reverseReach",
    "CredentialsReuse",
    "dataSigned",
    "softwareProductVulnerabilityLocalAccessAchieved",
    "accessNetworkAndConnections",
    "accessNetworkData",
    "passwordReuseCompromise",
    "ReadFromSoftProdVulnerability",
    "UseVulnerabilityFromPhysicalAccess",
    "specificAccess",
    "payloadInspectionBypassed",
    "attackerUnsafeUserActivityCapability",
    "denyFromSoftProdVulnerability",
    "bypassAdversaryInTheMiddleDefenseFromPhysicalAccess",
    "delete",
    "authorizedApplicationRespondConnect",
    "networkAccess",
    "Lockout",
    "DeliverMaliciousRemovableMedia",
    "authorizedDeleteFromIAM",
    "bypassPayloadInspection",
    "userInteractionAchieved",
    "attackerUnsafeUserActivityCapabilityWithReverseReach",
    "networkConnectFromResponse",
    "Modify",
    "spreadWormThroughRemovableMedia",
    "DenyFromReplica",
    "networkConnectUninspected",
    "connectToApplicationsUninspected",
    "Write",
    "deliverMaliciousRemovableMedia",
    "exploitWithEffort",
    "denyFromLockout",
    "bypassEavesdropDefenseFromPhysicalAccess",
    "networkForwardingInspected",
    "HardwareModifications",
    "authorizedReadFromApplication",
    "bypassAccessControl",
    "applicationRespondConnectThroughData",
    "modifyFromSoftProdVulnerability",
    "specificAccessAuthenticate",
    "supplyChainAuditingBypassed",
    "missingUser",
    "lockoutFromMembers",
    "bypassAdversaryInTheMiddleDefense",
    "ApplicationRespondConnect",
    "socialEngineering",
    "FullAccessFromSupplyChainCompromise",
    "propagateOneCredentialCompromised",
    "localConnect",
    "denyFromNetworkingAsset",
    "exploitTrivially",
    "fullAccessFromSupplyChainCompromise",
    "gainPhysicalAccess",
    "authorizedApplicationRespondConnectThroughData",
    "authorizedApplicationRespondConnectFromIAM",
    "readFromSoftProdVulnerability",
    "networkConnectInspected",
    "AuthorizedApplicationRespondConnectThroughData",
    "AccessInspectedFromPhysicalAccess",
    "credentialsReuse",
    "exploit",
    "read",
    "guessCredentials",
    "AccessNetworksUninspected",
    "authenticate",
    "useLeakedCredentials",
    "specificAccessFromNetworkConnection",
    "modify",
    "softwareCheck",
    "adversaryInTheMiddle",
    "authorizedDelete",
    "eavesdrop",
    "physicalAccess",
    "Assume",
    "specificAccessModify",
    "bypassPayloadInspectionFromEncryptedData",
    "[nop]",
    "softwareProductVulnerabilityLowPrivilegesAchieved",
    "AccessUninspectedFromPhysicalAccess",
    "ApplicationRespondConnectThroughData",
    "applicationRespondConnect",
    "softwareProductAbuse",
    "bypassHardwareModificationsProtection",
    "highPrivilegesAchieved",
    "ReadFromReplica",
    "write",
    "networkForwardingUninspected",
    "unsafeUserActivity",
    "networkConnect",
    "accessControlBypassed",
    "Delete",
    "accessNetworksInspected",
    "guessCredentialsFromHash",
    "specificAccessNetworkConnect",
    "AdversaryInTheMiddle",
    "credentialTheft",
    "authorizedWrite",
    "UseVulnerabilityFromSoftwareFullAccess",
    "weakCredentials",
    "connectToApplicationsInspected",
    "hardwareModifications",
    "effectivenessBypassed",
    "ConnectToApplicationsInspected",
    "specificAccessFromLocalConnection",
    "CredentialTheft",
    "missingIdentity",
    "useVulnerability",
    "ReverseReach",
    "readApplications",
    "specificAccessRead",
    "SoftwareProductAbuse",
    "use",
    "Use",
    "accessInspected",
    "authorizedReadFromIAM",
    "bypassSecurityAwareness",
    "accessSpoofedData",
    "inherentUserInteraction",
    "Deny",
    "softwareProductVulnerabilityPhysicalAccessAchieved",
    "Read",
    "abuse",
    "AccessNetworksInspected",
    "softwareProductVulnerabilityNetworkAccessAchieved",
    "payloadInspectionBypassFromEncryptedData",
    "lockoutFromCredentials",
    "softwareProductVulnerabilityUserInteractionAchieved",
    "lowPrivilegesAchieved",
    "assume",
    "NetworkConnectFromResponse",
    "UseVulnerability",
    "networkAccessAchieved",
    "localAccessAchieved",
    "hardwareModificationsProtectionBypassed",
    "accessUnsignedData",
    "specificAccessDelete",
    "oneCredentialCompromised",
    "softwareProductVulnerabilityHighPrivilegesAchieved",
    "credsHashed",
    "DenyFromSoftProdVulnerability",
    "Exploit",
    "ConnectToApplicationsUninspected",
    "ExtractFromReplica",
    "UnsafeUserActivity",
    "modifyApplications",
    "bypassRestricted",
    "restrictedBypassed",
    "securityAwarenessBypassed",
    "compromiseApplications",
    "[end]",
    "fullAccess",
    "adversaryInTheMiddleDefenseBypassed",
    "authorizedAccessFromApplication",
    "dataEncrypted",
    "bypassContainerization",
    "SpreadWormThroughRemovableMedia",
    "physicalAccessAchieved",
    "authorizedWriteFromIAM",
    "eavesdropDefenseBypassed",
    "denyApplications",
    "Abuse",
    "accessDecryptedData",
    "SupplyChainAttack",
    "ModifyFromSoftProdVulnerability",
    "attackerUnsafeUserActivityCapabilityWithoutReverseReach",
    "accessUnencryptedData",
    "authorizedWriteFromApplication",
    "Eavesdrop",
    "bypassSupplyChainAuditing"
  ],
  "defender_actions": [
    "[nop]",
    "networkAccessRequired",
    "eavesdropDefense",
    "payloadInspection",
    "effectiveness",
    "supplyChainAuditing",
    "restricted",
    "highComplexityExploitRequired",
    "availabilityImpactLimitations",
    "noRemovableMediaUsage",
    "adversaryInTheMiddleDefense",
    "lowPrivilegesRequired",
    "hardwareModificationsProtection",
    "[end]",
    "notPresent",
    "physicalAccessRequired",
    "confidentialityImpactLimitations",
    "noPasswordReuse",
    "effortRequiredToExploit",
    "userInteractionRequired",
    "unique",
    "securityAwareness",
    "notDisclosed",
    "integrityImpactLimitations",
    "notGuessable",
    "networkAccessControl",
    "notPhishable",
    "highPrivilegesRequired",
    "localAccessRequired"
  ]
}